{
    "pies": [
        {
            "name": "Necessary Responsibilities",
            "slices": [
                {
                    "name": "Upcoming School",
                    "value": 100,
                    "desc": "School is coming up, and I am stressed about having to deal with the day-to-day stuff, keeping up with classes and being around a lot of people and whatnot."
                },
                {
                    "name": "Therapy",
                    "value": 80,
                    "desc": "Setting up a therapist has been extremely long and more complicated that it needed to be, I am stressed about having to actually set it up, as well as to make it to therapy every session."
                },
                {
                    "name": "Social Life",
                    "value": 50,
                    "desc": "It is necessary for me to rebuild my social life, find people I can hang out with and learn from in person so that I'm not stuck in my room all the time. I don't have to like them that much, just enjoy them enough to want to get out of the house to do stuff with them. Clubs (mainly CSC clubs) seem like a good outlet, but still a daunting task."
                },
                {
                    "name": "Spending Habit",
                    "value": 70,
                    "desc": "I have a bad habit of spending money and buying things I really don't need. It inhibits me from saving my money for more important things."
                },
                {
                    "name": "Cleaning my room",
                    "value": 20,
                    "desc": "Despite being a small menial task, the messiness of my room, and the overwhelming feeling whenever I want to try and clean it up somewhat, adds to my stress for sure."
                },
                {
                    "name": "College Money",
                    "value": 40,
                    "desc": "Self descriptive, shit ton of money, I want to get into a job that I can actually make serious money at."
                },
                {
                    "name": "Adulthood",
                    "value": 90,
                    "desc": "Becoming an adult is right around the corner, and it is terrifying, I don't think I have to explain this one."
                }
            ]
        },
        {
            "name": "Family",
            "slices": [
                {
                    "name": "Dad",
                    "value": 100,
                    "desc": "Pressuring me to work and work on myself, to do a lot and achieve a lot of things. Done out of love I'm sure, but not very helpful for the problems I'm really dealing with. I want to be able to open up, to tell him how things are really going so that he can understand better."
                },
                {
                    "name": "Mom",
                    "value": 50,
                    "desc": "I want to understand my mother and get closer with her, being close with my family, especially my parents is a big concern as I start to become an adult and need their help and assurance more than ever."
                },
                {
                    "name": "Olivia",
                    "value": 10,
                    "desc": "A great sister, and is definitely who I'm closest to in the whole family, but plays a better daughter than I am a son. She's a good sister again, I just wish I were better."
                },
                {
                    "name": "Robyn",
                    "value": 20,
                    "desc": "Tries to be a good sibling, ends up making me feel very self concious and bad about myself through them pointing out stuff about my physical appearance and the way I act."
                },
                {
                    "name":"Grandparents",
                    "value": 80,
                    "desc": "I'm not sure if my grandparents would approve of who I am as a person (very liberal, gay, etc.) but I want to get closer with them while I still have them. A dark thought, but being immersed into media like \\\"Everwhere at the end of time\\\" has made me uncannily aware of how soon it could be before I lose my grandparents."
                }
            ]
        },
        {
            "name": "External Pressures",
            "slices": [
                {
                    "name": "Dad - Job",
                    "value": 100,
                    "desc": "My dad has been constantly badgering me about getting a job, something I don't think I have the mental ability to handle right now. It sucks because I don't know how to explain to him that I can't handle one. But his constant pressure to get one is extremely stressful and one of my biggest stressors at the moment."
                },
                {
                    "name": "Expectations",
                    "value": 50,
                    "desc": "I feel like I am expected to do 'great things' and be successful. Again, a lot of that comes from my dad, but it's a lot of pressure to be expected to do even just moderately well in life."
                },
                {
                    "name": "Past friendships",
                    "value": 20,
                    "desc": "I feel a sense of guilt about having almost left my entire previous social life. But there are a few loose ends I need to take care of. Mainly that I have some birthday presents I need to give to Lake that I preordered long before my hiatus."
                }
            ]
        },
        {
            "name": "Goals",
            "slices": [
                {
                    "name": "Video Essays",
                    "value": 50,
                    "desc": "I always want to create video essays to share the information and skills I learn with other people. To make videos that I would have been absolutely dumbfounded if I were to watch them years ago."
                },
                {
                    "name": "Goblin game",
                    "value": 60,
                    "desc": "Kind of my main focus. Attempting to fix the same collision issue I've had for ages. A huge undertaking, honestly, yet something that I'm very passionate and excited about. Not super stressing, just something I wish I could be better at and do more with."
                },
                {
                    "name": "CSC Intern",
                    "value": 70,
                    "desc": "I do not want to work, but when I do, I want to join a Computer Science-related (Software Engineering?) internship, seeing as I probably wouldn't get a proper job in the field of computer science until after I've gotten a degree of some kind"
                },
                {
                    "name": "Making friends",
                    "value": 60,
                    "desc": "I'd say it's pretty self explanitory for me to want to make genuine friends."
                }
            ]
        }
    ]
}